// teacherData.js (ข้อมูลครู/อาจารย์ แยกตามแผนกจากระบบ RMS)
module.exports = {
  "ผู้อำนวยการ": [
    { name: "นายสุรินทร์ บุญสนอง", position: "ผู้อำนวยการ ผู้อำนวยการสถานศึกษาผู้บริหาร วิทยาลัยเทคนิคสมุทรปราการ"}
  ], 
  "รองผู้อำนวยการ": [
    { name: "ว่าที่ร้อยตรีวัฒนชัย บุญสุข", position: "รองผู้อำนวยการ ฝ่ายวิชาการผู้บริหาร" },
    { name: "ว่าที่ ร.ต.หญิงอารี พุ่มพวง", position: "รองผู้อำนวยการ ฝ่ายแผนงานและความร่วมมือผู้บริหาร" },
    { name: "จ่าสิบเอก เพิ่มเติม พลับพลา", position: "รองผู้อำนวยการ ฝ่ายบริหารทรัพยากรผู้บริหาร" },
    { name: "นางสาวอรทัย เลิศขุนทด", position: "รองผู้อำนวยการ ฝ่ายพัฒนากิจการนักเรียนนักศึกษาผู้บริหาร" }
  ],
  "หัวหน้าแผนก": [
    {   
      name: "นายปัญญา คูจิระประเสริฐ", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาช่างไฟฟ้ากำลัง",
        "ครูประจำ แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นายวีรยุทธ์ คเชนทร", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาก่อสร้าง",
        "ผู้ช่วยหัวหน้างาน งานวิจัยพัฒนานวัตกรรมและสิ่งประดิษฐ์",
        "ครูช่วยงาน งานโครงการพิเศษและการบริการชุมชน",
        "ครูช่วยงาน งานประกันคุณภาพและมาตรฐานการศึกษา",
        "ครูช่วยงาน งานอาชีวศึกษาระบบทวิภาคี"
      ] 
    },
    {   
      name: "นายพจณ์วัชรกรณ์ ภูมิเอี่ยม", 
      positions: [
        "หัวหน้าแผนก สามัญสัมพันธ์",
        "ครูประจำ สามัญสัมพันธ์",
        "ผู้ช่วยหัวหน้างาน งานทะเบียน",
        "ครูช่วยงาน งานวิทยบริการและห้องสมุด(ห้องสมุด)",
      ] 
    },
    {   
      name: "น.ส.ธารารัตน์ สมบัติ", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาเทคโนโลยีธุรกิจดิจิทัล",
        "ผู้ช่วยหัวหน้างาน งานสื่อการเรียนการสอน",
        "ครูช่วยงาน สำนักงานอาชีวศึกษาจังหวัดสมุทรปราการ(อศจ.)"
      ] 
    },
    {   
      name: "นางกมลลักษณ์ เชาว์มาก", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาเทคโนโลยีสารสนเทศ",
        "ผู้ช่วยหัวหน้างาน อาชีวศึกษาบัณฑิต",
        "ครูช่วยงาน งานพัฒนาหลักสูตรการเรียนการสอน",
        "ครูช่วยงาน งานประกันคุณภาพและมาตรฐานการศึกษา",
        "ครูช่วยงาน งานอาชีวศึกษาระบบทวิภาคี"
      ] 
    },
    {   
      name: "นายฉัตรชัย ทองเกียรติ", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาแม่พิมพ์โลหะ",
        "ครูช่วยงาน งานประกันคุณภาพและมาตรฐานการศึกษา"     
      ] 
    },
    {   
      name: "นายเอกลักษณ์ ดิลกธนานันท์", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาเขียนแบบเครื่องกล",
        "ผู้ช่วยหัวหน้างาน งานพัฒนาหลักสูตรการเรียนการสอน",
        "ครูช่วยงาน งานแนะแนวอาชีพและการจัดหางาน",
        "ครูช่วยงาน งานสวัสดิการนักเรียนนักศึกษา",
        "ครูช่วยงาน งานวัดผลและประเมินผล",
        "ครูช่วยงาน งานอาชีวศึกษาระบบทวิภาคี"     
      ] 
    },
    {   
      name: "น.ส.บุศรินทร์ บุญก่อ", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาการตลาด",
        "หัวหน้าแผนก แผนกวิชาธุรกิจค้าปลีก",
        "หัวหน้างาน งานกิจกรรมนักเรียนนักศึกษา",
        "ครูประจำ แผนกวิชาการตลาด",
        "ผู้ช่วยหัวหน้างาน งานประชาสัมพันธ์",
        "ผู้ช่วยหัวหน้างาน งานวิจัยพัฒนานวัตกรรมและสิ่งประดิษฐ์",
        "ผู้ช่วยหัวหน้างาน งานสวัสดิการนักเรียนนักศึกษา",
        "ครูช่วยงาน งานประกันคุณภาพและมาตรฐานการศึกษา",
        "ครูช่วยงาน งานทะเบียน",
        "ครูช่วยงาน สำนักงานอาชีวศึกษาจังหวัดสมุทรปราการ(อศจ.)"     
      ] 
    },
    {   
      name: "นายชัยวัฒน์ รัศมีจันทร์ฉาย", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาเทคนิคอุตสาหกรรม",
        "พนักงานราชการ(สอน) แผนกวิชาระบบขนส่งทางร่าง",
        "ผู้ช่วยหัวหน้างาน งานบุคลากร",
        "ครูปกครองประจำแผนก แผนกวิชาเทคนิคอุตสาหกรรม",
        "ครูช่วยงาน งานการเงิน",
        "ครูช่วยงาน งานวิจัยพัฒนานวัตกรรมและสิ่งประดิษฐ์",
        "ครูช่วยงาน งานแนะแนวอาชีพและการจัดหางาน",
        "ครูช่วยงาน สำนักงานอาชีวศึกษาจังหวัดสมุทรปราการ(อศจ.)"    
      ] 
    },
    {   
      name: "นางสาวบุปผา แสงเนตร", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาอาหารและโภชนาการ",
        "ครูประจำ แผนกวิชาอาหารและโภชนาการ"     
      ] 
    },
    {   
      name: "นางสาวพัชรินทร์ ใหม่ทอง", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาการบัญชี",
        "ครูประจำ แผนกวิชาการบัญชี",
        "ผู้ช่วยหัวหน้างาน งานการเงิน",
        "ผู้ช่วยหัวหน้างาน งานวัดผลและประเมินผล",
        "ครูช่วยงาน งานวัดผลและประเมินผล"     
      ] 
    },
    {   
      name: "น.ส.สุนทรี คนการ", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาแฟชั่นและสิ่งทอ",
        "ผู้ช่วยหัวหน้างาน งานอาคารสถานที่",
        "ผู้ช่วยหัวหน้างาน งานวัดผลและประเมินผล",
        "ครูปกครองประจำแผนก แผนกวิชาแฟชั่นและสิ่งทอ",
        "ครูช่วยงาน งานโครงการพิเศษและการบริการชุมชน"     
      ] 
    },
    {   
      name: "นายอภัยภัทร พัชราภา", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาช่างอิเล็กทรอนิกส์",
        "ผู้ช่วยหัวหน้างาน งานวิจัยพัฒนานวัตกรรมและสิ่งประดิษฐ์",
        "ครูช่วยงาน งานศูนย์ข้อมูลสารสนเทศ"     
      ] 
    },
    {   
      name: "นายทศพล ประทาน", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาช่างเชื่อมและโลหะแผ่น",
        "ผู้ช่วยหัวหน้างาน งานโครงการพิเศษและการบริการชุมชน",
        "ผู้ช่วยหัวหน้างาน งานอาชีวศึกษาระบบทวิภาคี",
        "ครูช่วยงาน งานสื่อการเรียนการสอน"
      ] 
    },
    {   
      name: "นายอภิรักษ์ อรรถเสถียร", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาช่างยนต์",
        "ครูประจำ แผนกวิชาช่างยนต์",
        "ครูช่วยงาน งานสวัสดิการนักเรียนนักศึกษา",
        "ครูช่วยงาน งานพัฒนาหลักสูตรการเรียนการสอน"
      ] 
    },
    {   
      name: "นายสัมพันธ์ ใกล้ชิด", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาห้องปฏิบัติการกลาง",
        "ครูช่วยงาน งานประกันคุณภาพและมาตรฐานการศึกษา",
        "ครูช่วยงาน อาชีวศึกษาบัณฑิตครูผู้ช่วย"
      ] 
    },
    {   
      name: "นางสาวศนภสร รอดสนใจ", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาการจัดการโลจีสติกส์",
        "หัวหน้างาน ประจำศูนย์อาชีวศึกษาทวิภาคีปริมณฑล 2",
        "ผู้ช่วยหัวหน้างาน งานบริหารงานทั่วไป(สารบรรณ)",
        "ผู้ช่วยหัวหน้างาน งานบุคลากร",
        "ผู้ช่วยหัวหน้างาน งานพัฒนาหลักสูตรการเรียนการสอน",
        "ผู้ช่วยหัวหน้างาน งานศูนย์ประสานงานพัฒนากำลังคนอาชีวศึกษาฯ (CEC)",
        "ครูช่วยงาน งานครูที่ปรึกษา",
        "ครูช่วยงาน งานประกันคุณภาพและมาตรฐานการศึกษา",
        "ครูช่วยงาน งานอาชีวศึกษาระบบทวิภาคี"
      ] 
    },
    {   
      name: "นายชยพล เทียนทอง", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาเทคนิคพื้นฐาน",
        "พนักงานราชการ(สอน) แผนกวิชาเทคนิคพื้นฐาน",
        "ครูช่วยงาน งานบุคลากร",
        "ครูช่วยงาน งานพัสดุ",
        "ครูช่วยงาน งานปกครอง",
        "ครูช่วยงาน สำนักงานอาชีวศึกษาจังหวัดสมุทรปราการ(อศจ.)"
      ] 
    },
    {   
      name: "นายประพรรณ เกษหอม", 
      positions: [
        "หัวหน้าแผนก ช่างอากาศยาน",
        "ครูประจำ แผนกวิชาห้องปฏิบัติการกลาง",
        "ผู้ช่วยหัวหน้างาน งานพัฒนาหลักสูตรการเรียนการสอน",
      ] 
    },
    {   
      name: "นายไชยพงศ์ สุวรรณ์", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาคอมพิวเตอร์กราฟฟิค",
        "หัวหน้าแผนก แผนกวิชาออกแบบ",
        "ครูช่วยงาน งานบุคลากร",
        "ครูช่วยงาน งานกิจกรรมนักเรียนนักศึกษา",
        "ครูช่วยงาน งานโครงการพิเศษและการบริการชุมชน",
        "ครูช่วยงาน งานสื่อการเรียนการสอน",
        "ครูช่วยงาน งานอาชีวศึกษาระบบทวิภาคี"
      ] 
    },
    {   
      name: "นายบัณฑิต บุตรคำโชติ", 
      positions: [
        "หัวหน้าแผนก แผนกวิชาวิจิตรศิลป์"
      ] 
    },
],
"หัวหน้างาน": [
    {   
      name: "นายสุธี ขำเมือง", 
      positions: [
        "หัวหน้างาน งานพัสดุ",
        "ครูประจำ แผนกวิชาช่างยนต์"
      ] 
    },
    {   
      name: "นางจรีพร วิจิตรเวชการ", 
      positions: [
        "หัวหน้างาน งานบัญชี",
        "ครูประจำ แผนกวิชาการบัญชี",
        "ครูช่วยงาน งานแนะแนวอาชีพและการจัดหางาน"
      ] 
    },
    {   
      name: "นายชาตรี สรงประเสริฐ", 
      positions: [
        "หัวหน้างาน งานโครงการพิเศษและการบริการชุมชน",
        "ครูประจำ แผนกวิชาช่างยนต์",
        "ครูช่วยงาน งานสื่อการเรียนการสอน",
        "ครูช่วยงาน อาชีวศึกษาบัณฑิต"
      ] 
    },
    {   
      name: "นายจิรวัฒน์ นนตระอุดร", 
      positions: [
        "หัวหน้างาน งานศูนย์ข้อมูลสารสนเทศ",
        "ครูประจำ แผนกวิชาช่างอิเล็กทรอนิกส์",
        "ครูช่วยงาน งานวิทยบริการและห้องสมุด(ห้องสมุด)",
        "ครูช่วยงาน งานสื่อการเรียนการสอน",
        "ผู้ดูแลระบบ ผู้ดูแลระบบหลัก"
      ] 
    },
    {   
      name: "นางศศินา ศักดิ์สุปราง", 
      positions: [
        "หัวหน้างาน งานสวัสดิการนักเรียนนักศึกษา",
        "ครูประจำ แผนกวิชาช่างอิเล็กทรอนิกส์",
        "ครูช่วยงาน งานอาชีวศึกษาระบบทวิภาคี",
        "ครูช่วยงาน ประจำศูนย์อาชีวศึกษาทวิภาคีปริมณฑล 2"
      ] 
    },
    {   
      name: "นายประโมทย์ เกตุบุญเลี้ยง", 
      positions: [
        "หัวหน้างาน งานความร่วมมือ",
        "ครูประจำ แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "ว่าที่ร้อยตรีมรกต วงศ์อรินทร์", 
      positions: [
        "หัวหน้างาน งานการเงิน",
        "ครูประจำ แผนกวิชาการบัญชี",
        "ผู้ช่วยหัวหน้างาน งานวางแผนและงบประมาณ",
        "ผู้ช่วยหัวหน้างาน งานโครงการพิเศษและการบริการชุมชน",
        "ครูปกครองประจำแผนก แผนกวิชาการบัญชี"
      ] 
    },
    {   
      name: "นายคำรณ เพ็ญทอง", 
      positions: [
        "หัวหน้างาน งานปกครอง",
        "ครูประจำ สามัญสัมพันธ์",
        "ครูช่วยงาน ประจำศูนย์อาชีวศึกษาทวิภาคีปริมณฑล 2"
      ] 
    },
    {   
      name: "นายศุภชัย แก้วประดิษฐ์", 
      positions: [
        "หัวหน้างาน พัฒนาหลักสูตร สาขาเทคโนโลยียานยนต์",
        "ครูประจำ แผนกวิชาช่างยนต์"
      ] 
    },
    {   
      name: "นางภัณฑิรา คเชนทร", 
      positions: [
        "หัวหน้างาน งานทะเบียน",
        "ครูประจำ สามัญสัมพันธ์",
        "ผู้ช่วยหัวหน้างาน งานประชาสัมพันธ์"
      ] 
    },
    {   
      name: "นายพัฒน์สาริทธิ์ มณีเขียว", 
      positions: [
        "หัวหน้างาน งานวัดผลและประเมินผล",
        "ครูประจำ แผนกวิชาเทคโนโลยีสารสนเทศ",
        "ผู้ช่วยหัวหน้างาน งานประกันคุณภาพและมาตรฐานการศึกษา",
        "ผู้ช่วยหัวหน้างาน อาชีวศึกษาบัณฑิต"
      ] 
    },
    {   
      name: "น.ส.มาลัยพร สายชุมดี", 
      positions: [
        "หัวหน้างาน งานวิจัยพัฒนานวัตกรรมและสิ่งประดิษฐ์",
        "ครูประจำ สามัญสัมพันธ์",
        "ผู้ช่วยหัวหน้างาน งานโครงการพิเศษและการบริการชุมชน",
        "ครูช่วยงาน งานวิทยบริการและห้องสมุด(ห้องสมุด)",
        "ครูช่วยงาน สำนักงานอาชีวศึกษาจังหวัดสมุทรปราการ(อศจ.)"
      ] 
    },
    {   
      name: "น.ส.มัชณิฎาศ์ สมอารยพงศ์", 
      positions: [
        "หัวหน้างาน งานวิทยบริการและห้องสมุด(ห้องสมุด)",
        "ครูช่วยงาน งานครูที่ปรึกษา"
      ] 
    },
    {   
      name: "นางสาวอิศราภรณ์ พูลบรรดิษฐ์", 
      positions: [
        "หัวหน้างาน งานบริหารงานทั่วไป(สารบรรณ)"
      ] 
    },
    {   
      name: "นางดวงชีวรรณ์ ศิริ", 
      positions: [
        "หัวหน้างาน งานบุคลากร",
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นายเสฐียรพงษ์ เอียดคง", 
      positions: [
        "หัวหน้างาน งานพัฒนาหลักสูตรการเรียนการสอน",
        "ครูประจำ แผนกวิชาช่างยนต์",
        "ผู้ช่วยหัวหน้างาน งานอาชีวศึกษาระบบทวิภาคี"
      ] 
    },
    {   
      name: "น.ส.เข็มพร ศรีมงคล", 
      positions: [
        "หัวหน้างาน อาชีวศึกษาบัณฑิต",
        "ครูประจำ แผนกวิชาการบัญชี",
        "ผู้ช่วยหัวหน้างาน งานวิทยบริการและห้องสมุด(ห้องสมุด)",
        "ผู้ช่วยหัวหน้างาน งานส่งเสริมผลิตผลการค้าและประกอบธุรกิจ",
        "ครูช่วยงาน งานวิจัยพัฒนานวัตกรรมและสิ่งประดิษฐ์",
        "ครูช่วยงาน งานแนะแนวอาชีพและการจัดหางาน",
        "ครูช่วยงาน งานสื่อการเรียนการสอน"
      ] 
    },
    {   
      name: "นางสาวพิมณภรณ์ ศิริธานีวัฒน์", 
      positions: [
        "หัวหน้างาน งานอาชีวศึกษาระบบทวิภาคี",
        "ครูประจำ แผนกวิชาการบัญชี"
      ] 
    },
    {   
      name: "นางชุติมา ขอบไชยแสง", 
      positions: [
        "หัวหน้างาน สำนักงานอาชีวศึกษาจังหวัดสมุทรปราการ(อศจ.)",
        "พนักงานราชการ(สอน) แผนกวิชาช่างไฟฟ้ากำลัง",
        "ครูช่วยงาน งานอาชีวศึกษาระบบทวิภาคี",
        "ครูช่วยงาน ประจำศูนย์อาชีวศึกษาทวิภาคีปริมณฑล 2"
      ] 
    },
    {   
      name: "นางสาววันวิสา ชาวโพงพาง", 
      positions: [
        "หัวหน้างาน งานบุคลากร",
        "พนักงานราชการทั่วไป งานบุคลากร",
        "ผู้ดูแลระบบ ผู้ดูแลระบบหลัก"
      ] 
    },
    {   
      name: "นายวินัย จบเจนไพร", 
      positions: [
        "หัวหน้างาน งานสื่อการเรียนการสอน",
        "ครูประจำ แผนกวิชาช่างอิเล็กทรอนิกส์",
        "ครูช่วยงาน งานศูนย์ข้อมูลสารสนเทศ",
        "ครูช่วยงาน งานโครงการพิเศษและการบริการชุมชน"
      ] 
    },
    {   
      name: "นางสาวภณิชชา เนื่องขันตี", 
      positions: [
        "หัวหน้างาน งานวางแผนและงบประมาณ",
        "ครูประจำ แผนกวิชาการบัญชี",
        "ผู้ช่วยหัวหน้างาน งานการเงิน",
        "ผู้ช่วยหัวหน้างาน งานบัญชี"
      ] 
    },
    {   
      name: "นายนิสสรณ์ สุวรรณวิชาเลิศ", 
      positions: [
        "หัวหน้างาน อาชีวศึกษาบัณฑิต",
        "ผู้ช่วยหัวหน้างาน งานประชาสัมพันธ์",
        "ผู้ช่วยหัวหน้างาน งานแนะแนวอาชีพและการจัดหางาน",
        "ครูช่วยงาน งานประกันคุณภาพและมาตรฐานการศึกษา",
        "ครูช่วยงาน งานอาชีวศึกษาระบบทวิภาคี"
      ] 
    },
    {   
      name: "นางสาวนิตยา รอบรู้", 
      positions: [
        "หัวหน้างาน งานส่งเสริมผลิตผลการค้าและประกอบธุรกิจ",
        "ครูประจำ แผนกวิชาการตลาด",
        "ครูช่วยงาน งานแนะแนวอาชีพและการจัดหางาน"
      ] 
    },
    {   
      name: "นางสาววนิดา อุตรักษ์", 
      positions: [
        "หัวหน้างาน งานประกันคุณภาพและมาตรฐานการศึกษา",
        "ครูประจำ แผนกวิชาการโรงแรมและการท่องเที่ยว",
        "ครูช่วยงาน งานโครงการพิเศษและการบริการชุมชน"
      ] 
    },
    {   
      name: "นายขจรศักดิ์ กิมชุนมณี", 
      positions: [
        "หัวหน้างาน งานแนะแนวอาชีพและการจัดหางาน",
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นายกิตติพงษ์ จันทศร", 
      positions: [
        "หัวหน้างาน งานครูที่ปรึกษา",
        "ครูประจำ แผนกวิชาการจัดการโลจีสติกส์",
        "ผู้ช่วยหัวหน้างาน งานกิจกรรมนักเรียนนักศึกษา",
        "ครูช่วยงาน งานพัฒนาหลักสูตรการเรียนการสอน",
        "ครูช่วยงาน งานอาชีวศึกษาระบบทวิภาคี"
      ] 
    },
    {   
      name: "นายปัทวี ศรีอภัย", 
      positions: [
        "หัวหน้างาน งาน กรอ.",
        "ครูประจำ แผนกวิชาช่างยนต์",
        "ผู้ช่วยหัวหน้างาน งานความร่วมมือ"
      ] 
    },
    {   
      name: "นางพรทิพย์ ชลกาญจน์", 
      positions: [
        "หัวหน้างาน งานประชาสัมพันธ์",
        "ครูประจำ แผนกวิชาธุรกิจค้าปลีกครูผู้ช่วย"
      ] 
    },
    {   
      name: "นายประกิจ สร้อยระย้าแก้ว", 
      positions: [
        "หัวหน้างาน งานอาคารสถานที่",
        "ครูประจำ แผนกวิชาก่อสร้าง"
      ] 
    },
],
"ครูประจำ": [
    {   
      name: "นางกุลสุดา เกื้อน้อย", 
      positions: [
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นายอรุณ กำเหนิดนนท์", 
      positions: [
        "ครูประจำ แผนกวิชาช่างอิเล็กทรอนิกส์"
      ] 
    },
    {   
      name: "นายนราวุฒิ ปลื้มบำเรอ", 
      positions: [
        "ครูประจำ แผนกวิชาห้องปฏิบัติการกลาง"
      ] 
    },
    {   
      name: "นายเกียรติกร วิจิตรเวชการ", 
      positions: [
        "ครูประจำ แผนกวิชาช่างยนต์"
      ] 
    },
    {   
      name: "นายชัชวาลย์ บิกสุวรรณ", 
      positions: [
        "ครูประจำ แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นายณัฐวุฒิ จินดากุล", 
      positions: [
        "ครูประจำ แผนกวิชาช่างกลโรงงาน"
      ] 
    },
    {   
      name: "นายบุญรวม ทองขาว", 
      positions: [
        "ครูประจำ แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นายทวี สว่างวงษ์", 
      positions: [
        "ครูประจำ แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "วิชัย แซ่โล้ว", 
      positions: [
        "ครูประจำ แผนกวิชาก่อสร้าง"
      ] 
    },
    {   
      name: "นายคงพันธ์ ไชยตัน", 
      positions: [
        "ครูประจำ แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นางอัจฉรา เรืองรัตน์", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีธุรกิจดิจิทัล"
      ] 
    },
    {   
      name: "นายชาญณรงค์ นามสนิท", 
      positions: [
        "ครูประจำ แผนกวิชาช่างยนต์"
      ] 
    },
    {   
      name: "นายแสนพล กล่อมหอ", 
      positions: [
        "ครูประจำ แผนกวิชาช่างยนต์"
      ] 
    },
    {   
      name: "นายปฏิญญา กลิ่นหอม", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีธุรกิจดิจิทัล"
      ] 
    },
    {   
      name: "นางศศิลักษณ์ ไชยตัน", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีธุรกิจดิจิทัล"
      ] 
    },
    {   
      name: "นายวุฒิชัย พรหมพินิจ", 
      positions: [
        "ครูประจำ แผนกวิชาช่างยนต์"
      ] 
    },
    {   
      name: "น.ส.ยุภาพักตร์ ประทุมมาศ", 
      positions: [
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นายรุ่งรุจ เผยศิริ", 
      positions: [
        "ครูประจำ แผนกวิชาช่างกลโรงงาน"
      ] 
    },
    {   
      name: "นางสาวชญาภา นัยนิตย์", 
      positions: [
        "ครูประจำ แผนกวิชาการบัญชี"
      ] 
    },
    {   
      name: "นายนิติ เกื้อกูลวงศ์ชัย", 
      positions: [
        "ครูประจำ แผนกวิชาช่างอิเล็กทรอนิกส์"
      ] 
    },
    {   
      name: "กรธัช ดารีย์", 
      positions: [
        "ครูประจำ แผนกวิชาการโรงแรมและการท่องเที่ยว"
      ] 
    },
    {   
      name: "สุทิศา พรรณไวย", 
      positions: [
        "ครูประจำ แผนกวิชาการบัญชี"
      ] 
    },
    {   
      name: "วิราช เรืองทรัพย์", 
      positions: [
        "ครูประจำ แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นางสาวสุภัทราภรณ์ สุโข", 
      positions: [
        "ครูประจำ แผนกวิชาการตลาด"
      ] 
    },
    {   
      name: "นางสาวนาตยา พิมสอน", 
      positions: [
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นางสาวชุติมา วังลำ", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีธุรกิจดิจิทัล"
      ] 
    },
    {   
      name: "นางสาวภูษณิศา ภูเนตร", 
      positions: [
        "ครูประจำ แผนกวิชาช่างยนต์"
      ] 
    },
    {   
      name: "นางสาวณิภกร ศรีเกตุ", 
      positions: [
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นายศรายุธ แอบท้องไทร", 
      positions: [
        "ครูประจำ แผนกวิชาแม่พิมพ์โลหะ"
      ] 
    },
    {   
      name: "นางสาวมณฑนา อิทธิพลากร", 
      positions: [
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นางสาวสุพัชรินทร์ เสียงประเสริฐ", 
      positions: [
        "ครูประจำ แผนกวิชาอาหารและโภชนาการ"
      ] 
    },
    {   
      name: "นางสาวพรมณี ฮุยเกี๊ยะ", 
      positions: [
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นางสาวสิรินดา แสงกำพลี", 
      positions: [
        "ครูประจำ แผนกวิชาช่างกลโรงงาน"
      ] 
    },
    {   
      name: "นางสาวกุลจรีย์ สองจาด", 
      positions: [
        "ครูประจำ แผนกวิชาวิจิตรศิลป์"
      ] 
    },
    {   
      name: "นายสาทร ทองถึง", 
      positions: [
        "ครูประจำ แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นางสาวสุวัจนา จริตกาย", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีธุรกิจดิจิทัล"
      ] 
    },
    {   
      name: "นางกาญจนา สัมภาวะผล", 
      positions: [
        "ครูประจำ แผนกวิชาช่างเชื่อมและโลหะแผ่น"
      ] 
    },
    {   
      name: "นางสาวณัฐธิดา สมบุญยอด", 
      positions: [
        "ครูประจำ แผนกวิชาการตลาด"
      ] 
    },
    {   
      name: "นายศักรินทร์ ภูพันนา", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีสารสนเทศ"
      ] 
    },
    {   
      name: "นายวัชรา ดนตรีสวัสดิ์", 
      positions: [
        "ครูประจำ แผนกวิชาแม่พิมพ์โลหะ"
      ] 
    },
    {   
      name: "นายธงนกรณ์ เสาสูงยาง", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีสารสนเทศ"
      ] 
    },
    {   
      name: "นางสาวณิชกานต์ ชาลีเครือ", 
      positions: [
        "ครูประจำ แผนกวิชาช่างอิเล็กทรอนิกส์"
      ] 
    },
    {   
      name: "นายฉมาพรรณ พินิจการ", 
      positions: [
        "ครูประจำ แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นายเจตรินทร์ ศรีอาราม", 
      positions: [
        "ครูประจำ แผนกวิชาช่างกลโรงงาน"
      ] 
    },
    {   
      name: "นายกิตติชัย นาศา", 
      positions: [
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นางสาวภัทร์ธีรา ฤทธิคุปต์", 
      positions: [
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นางสาวบงกช เติมสุข", 
      positions: [
        "ครูประจำ แผนกวิชาการจัดการโลจีสติกส์"
      ] 
    },
    {   
      name: "นายถิรวัฒน์ รัตนมณี", 
      positions: [
        "ครูประจำ แผนกวิชาช่างกลโรงงาน"
      ] 
    },
    {   
      name: "นายเมธี อุดหนองเลา", 
      positions: [
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นายอดิศักดิ์ เดชผดุง", 
      positions: [
        "ครูประจำ แผนกวิชาช่างอิเล็กทรอนิกส์"
      ] 
    },
    {   
      name: "นายนิธิพัฒน์ ศิริกัณรัตน์", 
      positions: [
        "ครูประจำ แผนกวิชาคอมพิวเตอร์กราฟ"
      ] 
    },
    {   
      name: "นางสาวกาญจนา เรืองสมบัติ", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีธุรกิจดิจิทัล"
      ] 
    },
    {   
      name: "นายเกียรติศักดิ์ ขุนหาญ", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีสารสนเทศ"
      ] 
    },
    {   
      name: "นายค้ำคูณ โรจนาวรรณ", 
      positions: [
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นายธงชัย สารสุข", 
      positions: [
        "ครูประจำ แผนกวิชาช่างยนต์"
      ] 
    },
    {   
      name: "นางสาวอุลารัตน์ การัตน์", 
      positions: [
        "ครูประจำ แผนกวิชาการบัญชี"
      ] 
    },
    {   
      name: "นางนรินทร์สิรี ศรีนามขัย", 
      positions: [
        "ครูประจำ แผนกวิชาเทคนิคพื้นฐาน"
      ] 
    },
    {   
      name: "นางสาวนิสารัตน์ สอดจิตต์", 
      positions: [
        "ครูประจำ แผนกวิชาการตลาด"
      ] 
    },
    {   
      name: "ว่าที่ร้อยตรีเอกพันธ์ แก้วก๋า", 
      positions: [
        "ครูประจำ แผนกวิชาช่างยนต์"
      ] 
    },
    {   
      name: "นายปิยะพล พรรณยิ้ม", 
      positions: [
        "ครูประจำ แผนกวิชาคอมพิวเตอร์กราฟฟิค"
      ] 
    },
    {   
      name: "นางสาวศศิร์อร ศักดิ์วิเศษ", 
      positions: [
        "ครูประจำ สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นายกล้าณรงค์ แรงจบ", 
      positions: [
        "ครูประจำ แผนกวิชาช่างเชื่อมและโลหะแผ่น"
      ] 
    },
    {   
      name: "นางสาวประภาพร โคกแดง", 
      positions: [
        "ครูประจำ แผนกวิชาก่อสร้าง"
      ] 
    },
    {   
      name: "นายปฏิพาน เสระทอง", 
      positions: [
        "ครูประจำ แผนกวิชาช่างยนต์"
      ] 
    },
    {   
      name: "นายธีรศานต์ สัตย์รักษา", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีธุรกิจดิจิทัล"
      ] 
    },
    {   
      name: "นายมารุต วงษ์วารี", 
      positions: [
        "ครูประจำ แผนกวิชาเทคนิคพื้นฐาน"
      ] 
    },
    {   
      name: "นางสาววันนิษา แสนทวีสุข", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีธุรกิจดิจิทัล"
      ] 
    },
    {   
      name: "ว่าที่ร้อยตรีครนพ บุญกว้าง", 
      positions: [
        "ครูประจำ แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นายอนุชา สอนชัด", 
      positions: [
        "ครูประจำ แผนกวิชาการจัดการโลจีสติกส์"
      ] 
    },
    {   
      name: "นางสาวมุจรินทร์ ภูชำนิ", 
      positions: [
        "ครูประจำ แผนกวิชาวิจิตรศิลป์"
      ] 
    },
    {   
      name: "นายดนัย ทับอ่ำ", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีสารสนเทศ"
      ] 
    },
    {   
      name: "นางจารุณี มะขามป้อม", 
      positions: [
        "ครูประจำ แผนกวิชาเทคโนโลยีสารสนเทศ"
      ] 
    },
    {   
      name: "นายพิชญ์รัฐ จันทรครุธ", 
      positions: [
        "ครูประจำ แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นายเทพติกุล สาสดีอ่อง", 
      positions: [
        "ครูประจำ แผนกวิชาห้องปฏิบัติการกลาง"
      ] 
    },
    {   
      name: "นางสาวธนพร ชื่นบุญชู", 
      positions: [
        "ครูประจำ แผนกวิชาเทคนิคอุตสาหกรรม"
      ] 
    },
    {   
      name: "นางสาวปัญจรัตน์ กอบการ", 
      positions: [
        "ครูประจำ แผนกวิชาอาหารและโภชนาการ"
      ] 
    },
    {   
      name: "นางสาวนภัสวรรณ ขำแก้ว", 
      positions: [
        "ครูประจำ แผนกวิชาออกแบบ"
      ] 
    },
    {   
      name: "นายอภิวิชญ์ สถิตศตคุณ", 
      positions: [
        "ครูประจำ แผนกวิชาการบัญชี"
      ] 
    },
    {   
      name: "นายธนาธิป ไกรษร", 
      positions: [
        "ครูประจำ แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นายพรพจน์ คงคา", 
      positions: [
        "ครูประจำ แผนกวิชาเขียนแบบเครื่องกล"
      ] 
    },
    {   
      name: "รุ่งอุบล แดนโคตรผม", 
      positions: [
        "ครูประจำ แผนกวิชาช่างเชื่อมและโลหะแผ่น"
      ] 
    },
],
"พนักงานราชการ(สอน)": [
    {   
      name: "นายปัญญา แก้วขาว", 
      positions: [
        "พนักงานราชการ(สอน) แผนกวิชาช่างอิเล็กทรอนิกส์"
      ] 
    },
    {   
      name: "นางสาววริยาลักษณ์ กลิ่นทับ", 
      positions: [
        "พนักงานราชการ(สอน) แผนกวิชาแม่พิมพ์โลหะ"
      ] 
    },
    {   
      name: "ญาณนันท์ มาสะวิทู", 
      positions: [
        "พนักงานราชการ(สอน) แผนกวิชาช่างกลโรงงาน"
      ] 
    },
    {   
      name: "นายกรณอมรฉัตร ภู่ศรีคำวรกาญจน์", 
      positions: [
        "พนักงานราชการ(สอน) แผนกวิชาเทคโนโลยีธุรกิจดิจิทัล"
      ] 
    },
    {   
      name: "นายภัทรพล พูลสวัสดิ์", 
      positions: [
        "พนักงานราชการ(สอน) แผนกวิชาช่างกลโรงงาน"
      ] 
    },
    {   
      name: "นายสัมฤทธิ์ผล รักษาพงศ์", 
      positions: [
        "พนักงานราชการ(สอน) แผนกวิชาเขียนแบบเครื่องกล"
      ] 
    },
],
"ครูอัตราจ้าง": [
    {   
      name: "น.ส.อรุณรุ่ง พึ่งร่วมกลาง", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาธุรกิจค้าปลีก"
      ] 
    },
    {   
      name: "นายภาสกร ปภาศิริวาทย์", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาการตลาด"
      ] 
    },
    {   
      name: "นายทศพล ฟ้าคุ้ม", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาช่างยนต์"
      ] 
    },
    {   
      name: "นางณัฐชานันท์ ดิลกธนานันท์", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาเทคโนโลยีสารสนเทศ"
      ] 
    },
    {   
      name: "นายศธรรดร ภาชนะศิริ", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาการตลาด"
      ] 
    },
    {   
      name: "นางสาวกรองทิพย์ ยัสพันธุ์", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาอาหารและโภชนาการ"
      ] 
    },
    {   
      name: "นางสาวเสาวนิตย์ หีบแก้ว", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาช่างกลโรงงาน"
      ] 
    },
    {   
      name: "นางสาวพรรณราย สิงห์ล้ำเลิศ", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาก่อสร้าง"
      ] 
    },
    {   
      name: "นายธนพล นาคงาม", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นางสาวจิรัฐกาล ปั้นจาด", 
      positions: [
        "ครูอัตราจ้าง สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นายนิมิต ชวดคำ", 
      positions: [
        "ครูอัตราจ้าง สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นางสาวปิยะรัตน์ มั่นคง", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาก่อสร้าง"
      ] 
    },
    {   
      name: "นายกรวิทย์ ภานิล", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาช่างอิเล็กทรอนิกส์"
      ] 
    },
    {   
      name: "นางสาวพิมนิสา ดวงสุภา", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาก่อสร้าง"
      ] 
    },
    {   
      name: "นางสาววลัยรักษ์ แพงจันทร์", 
      positions: [
        "ครูอัตราจ้าง สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นางสาวนริศรา เหลาลอย", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาเทคโนโลยี"
      ] 
    },
    {   
      name: "นางสาวสุปาณี จันทร์ต๊ะเขต", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาช่างอิเล็กทรอนิกส์"
      ] 
    },
    {   
      name: "นางสาวสุธาวี บุญสายัง", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาเทคโนโลยีสารสนเทศ"
      ] 
    },
    {   
      name: "นายวิทยา ปัตตาเทสัง", 
      positions: [
        "ครูอัตราจ้าง สามัญสัมพันธ์"
      ] 
    },
    {   
      name: "นางสาวสติมา กล่ำแสง", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาช่างยนต์"
      ] 
    },
    {   
      name: "นางสาววราภรณ์ บัวเผื่อน", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาแฟชั่นและสิ่งทอ"
      ] 
    },
    {   
      name: "นางสาวนูรอัยด้า หมัดระเด่น", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นายไพฑูรย์ เท้าไม้สน", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาช่างไฟฟ้ากำลัง"
      ] 
    },
    {   
      name: "นางสาวจิราพัชร ละออ", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาเทคนิคอุตสาหกรรม"
      ] 
    },
    {   
      name: "นางสาวภัณฑิรา เดือนแร่รัมย์", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาออกแบบ"
      ] 
    },
    {   
      name: "นายธนบัตร แจวเจริญ", 
      positions: [
        "ครูอัตราจ้าง แผนกวิชาห้องปฏิบัติการกลาง"
      ] 
    },
]
};
